Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: གཡོན་པ་ཁྲོ་བོའི་ལུས་ཀྱིས་གནས་པ་རྡོ་རྗེ་ཁུ་ཚུར་མ་རྡོ་རྗེ་ལྕགས་ཀྱུ་མ་རྡོ་རྗེ་ལུ་གུ་རྒྱུད་མ་དཔུང་བཟང་མ་རྡོ་རྗེ་སྡེ་མ་ཆ་བྱད་ཅི་ལྟ་བ་བཞིན་དུ་བགེགས་ཀྱི་གདན་ལ་གནས་པ། རིག་པའི་རྒྱལ་པོ་ཐམས་ཅད་དང་རིག་པའི་རྒྱལ་མོ་འཁོར་དང་བཅས་པ་བཟླས་པ་དང་། ཕྱག་རྒྱ་དང་ལྡན་པ་ཇི་ལྟར་ཤེས་པ་བཞིན་བྲི་བར་བྱའོ། །
en: his left is clenched into a vajra fist in an expression of wrath. Vajrāṅkuśī, Vajraśṛṅkhalā, Subāhu , and Vajrasenā should all be painted in their respective locations, wearing their specific apparel and emblems and surrounded by retinues of vidyārāja s and vidyārājñīs. Their forms, postures, and so forth should be drawn according to the tradition.

source: དེ་དག་གི་ཡང་གཡོན་དུ་ཟུར་བཞིར་སྣ་ཚོགས་རྡོ་རྗེའི་ཕྱག་རྒྱ་བྲི་བར་བྱ་སྟེ།
en: To their left, a symbol of the double vajra should be painted in the shape of a square.

source: བྲིས་ནས་ཀྱང་གནས་གང་དུ་རིག་པའི་ཚོགས་མ་དྲན་པའི་གནས་དེ་དག་ཀྱང་འདིར་བཞུགས་ཤིག་ཅེས་བརྗོད་པར་བྱའོ། །
en: Once painted, the following should be said: ‘In this place, where vidyā beings have not been known to assemble, may they now come to reside.’ {2.144}

source: དེའི་སྟེང་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་། བཅོམ་ལྡན་འདས་ཡུམ་མཱ་མ་ཀཱི་བྲི་བར་བྱ་སྟེ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། གཟུགས་ཤིན་ཏུ་མཛེས་པར་བྱའོ། །
en: “Above them should be painted the six pāramitā goddesses and the blessed Māmakī, all of them with serene forms adorned with all types of jewelry.

source: དེ་དག་གི་སྟེང་དུ་གཙུག་ཏོར་གྱི་རྒྱལ་པོ་བརྒྱད་ཀུན་ནས་འབར་བའི་ཕྲེང་བའི་ཕྱག་རྒྱ་བཅིངས་ནས་
en: Above them are the eight uṣṇīṣa kings, each surrounded by a halo of blazing light.

source: རང་རང་དག་གི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཆེན་པོའི་གཟུགས་སུ་བྲི་བར་བྱ་སྟེགསེར་གྱི་མདོག་ཅན་དབང་པོ་ཤིན་ཏུ་དུལ་ལ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: Having first formed the appropriate mudrā, the respective forms of these great cakravartin kings should be painted, golden in color, with pacified senses and adorned with all types of jewelry.

source: དེ་བཞིན་གཤེགས་པ་ལ་ཟུར་གྱིས་བལྟ་བ་དག་ལ།
en: Their gaze is cast slightly in the direction of the image of the Tathāgata (Śākyamuni).

source: འདི་ལྟ་སྟེ། གཙུག་ཏོར་འཁོར་ལོས་སྒྱུར་བ་དང་། གཙུག་ཏོར་མངོན་པར་འཕགས་པ་དང་། གཙུག་ཏོར་གདུགས་དཀར་པོ་དང་། རྒྱལ་བའི་གཙུག་ཏོར་དང་། པདྨའི་གཙུག་ཏོར་དང་། རྣམ་པར་རྒྱལ་བའི་གཙུག་ཏོར་དང་། གཟི་བརྗིད་ཕུང་པོའི་གཙུག་ཏོར་དང་། གཙུག་ཏོར་མཐོན་པོ་སྟེ།
en: These eight are Cakra­vartyuṣṇīṣa, Abhyudgatoṣṇīṣa, Sitātapatra, Jayoṣṇīṣa, Kamaloṣṇīṣa, Vijayoṣṇīṣa, Tejorāśi, and Unnatoṣṇīṣa. {2.145}

source: བརྒྱད་པོ་འདི་དག་ནི་གཙུག་ཏོར་གྱི་རྒྱལ་པོ་རྣམས་སོ། །
en: “These eight uṣṇīṣa kings

source: གཡོན་དུ་བྲི་བ་ནི་རང་སངས་རྒྱས་རྣམས་སོ། །
en: should be painted to the left of the pratyeka­buddhas.

source: འཇུག་པའི་ཕྱོགས་ཀྱི་སྒོར་ནི་བྱང་ཆུབ་སེམས་དཔའ་གཉིས་བྱ་སྟེ།
en: At the gate should be two bodhisattvas:

source: གཡས་ཕྱོགས་སུ་ནི་འཇིག་རྟེན་ལས་འདས་པར་འགྲོ་བ་ཞེས་བྱ་བ་རལ་པའི་ཅོད་པན་འཆང་བ།
en: to the right of the entrance, one called Lokātikrānta­gāmin, and to the left, the great bodhisattva called Ajitañjaya.

source: ལུས་ཞི་བ་ལག་པ་གཡས་པ་མཆོག་སྦྱིན་པས་ཕྲེང་བ་འཛིན་པ། ལག་པ་གཡོན་པས་སྤྱི་བླུགས་འཛིན་ཅིང་སྒོ་ལ་མངོན་དུ་ཕྱོགས་པ་བཞིན་ཅུང་ཟད་ཁྲོ་གཉེར་དང་བཅས་པ་བྲི་བར་བྱའོ།
en: The first should be depicted as having a peaceful form, wearing a diadem on his topknotted hair, holding a rosary in his right hand and a water jar in his left, facing the gate, and with a slight frown on his face.

source: ལུས་རབ་ཏུ་ཞི་བ་རལ་པའི་ཅོད་པན་འཆང་བ། ལག་པ་གཡོན་པ་ན་དབྱིག་པ་དང་སྤྱི་བླུགས་འཛིན་པ། ལག་པ་གཡས་པ་ན་མཆོག་སྦྱིན་པ་ཕྲེང་བ་འཛིན་པ་བཞིན་ཅུང་ཟད་ཁྲོ་གཉེར་དང་ལྡན་པ་སྒོ་ལ་མངོན་དུ་ཕྱོགས་པ་བྲིའོ། །
en: The other has a peaceful form, wears a diadem on his topknotted hair and carries a staff and a water jar in his left hand, and in his right hand, which displays a boon-granting gesture, he carries a rosary. He should be painted facing the gate, with a slight frown on his face. {2.146}

source: སེང་གེའི་ཁྲིའི་འོག་ཏུ་ཆོས་ཀྱི་འཁོར་ལོ་ཀུན་ཏུ་འབར་བས་ཁྱབ་པ།
en: “Below the lion throne should be painted a Dharma wheel surrounded by a halo of blazing light.

source: དེའི་འོག་ཏུ་རིན་པོ་ཆེའི་གཞལ་མེད་ཁང་དེ་ལ་གནས་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ། གཞོན་ནུའི་གཟུགས་ཅན་སྐུ་མདོག་དམར་སྐྱ་ཞི་བའི་གཟུགས་དང་། མཛེས་པའི་གཟུགས་ཅན་ཅུང་ཟད་ཞལ་འཛུམ་པ།
en: Below that should be painted a jeweled palace within which is Lord Mañjuśrī, the divine youth, the great bodhisattva, with a youthful body of pale saffron color. He has a peaceful form of beautiful appearance and a gentle smile on his face.

source: ཕྱག་གཡོན་པ་ན་ཨུཏྤ་ལ་སྔོན་པོ་བསྣམས་པ་ཕྱག་གཡས་པ་ན་བིལ་བ་བསྣམས་པ།
en: In his left hand he holds a blue lotus; with his right he displays a boon-granting gesture and holds a wood-apple fruit. {2.147}

source: བྱིས་པའི་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། གཙུག་ཕུད་ལྔས་ཉེ་བར་མཛེས་པར་གྱུར་པ་མུ་ཏིག་གི་ཕྲེང་བས་མཆོད་ཕྱིར་ཐོགས་པ་དར་ལའི་སྟོད་གཡོགས་མནབས་པ་དར་གྱི་ན་བཟས་སྨད་གཡོགས་མཛད་པ་འོད་ཀུན་ནས་འཕྲོ་བ་འབར་བའི་ཕྲེང་བས་ཀུན་ནས་ཁྱབ་པ་པདྨའི་གདན་ལ་ཉེ་བར་བཞུགས་པ་ཁྲོ་བོའི་རྒྱལ་པོ་གཤིན་རྗེ་གཤེད་ལ་གཟིགས་པ་དཀྱིལ་འཁོར་དུ་འཇུག་པའི་སྒོ་ལ་མངོན་དུ་ཕྱོགས་པ་བལྟ་ན་སྡུག་པ་བྲི་བར་བྱའོ། །
en: “He is adorned with all the ornaments of youth and is decorated with five locks of hair. He wears a string of pearls, a sacred cord, a silken bodice, and garments of silk. Shining in all directions, he is surrounded by a halo of blazing light. He sits on a lotus seat facing the entrance gate of the maṇḍala and looks toward Yamāntaka, Lord of Wrath . He should be painted as being beautiful to behold in every respect. {2.148}

source: དེའི་གཡས་ཕྱོགས་ཀྱི་ངོས་ཀྱི་པདྨའི་འོག་ཏུ་ཁྲོ་བོའི་རྒྱལ་པོ་གཤིན་རྗེ་གཤེད་བྲི་བར་བྱ་སྟེ།
en: “On his right side, below the lotus, should be painted Yamāntaka, Lord of Wrath ,

source: མི་སྡུག་པ་ཆེན་པོའི་གཟུགས་ཅན་ཀུན་ནས་འབར་བའི་ཕྲེང་བས་ཁྱབ་པ། བཀའ་ལེན་ཅིང་འཛིན་པ། བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོའི་ཕྱོགས་སུ་ལྟ་བའོ་གཡོན་ཕྱོགས་ཀྱི་པདྨའི་འོག་ཏུ་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུའི་གཟུགས་ཅན། བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བྲི་བར་བྱ་བ་ལ་
en: in his ugly misshapen form, completely surrounded by blazing light. Awaiting a command, he looks at the great bodhisattva Mañjuśrī. He should be painted complete in every detail. On the left side of Mañjuśrī, below the lotus, should be painted five bodhisattvas in the form of gods of the realm of the Pure Abode.

source: འདི་ལྟ་སྟེ། ཤིན་ཏུ་དྲི་མེད་དང་ཤིན་ཏུ་དུལ་བ་དང་དག་པ་དང་མུན་སེལ་དང་ཀུན་ཏུ་སྣང་བའོ། །
en: These five are Sunirmala , Sudānta, Suśuddha, Tamodghātana, and Samantāvaloka.

source: དེ་དག་ཐམས་ཅད་ཀྱང་གནས་གཙང་མའི་གཞལ་མེད་ཁང་ན་འདུག་པ། རིན་པོ་ཆེ་དུ་མ་འབར་བའི་རྡོའི་སྟེང་དང་འདྲ་བ་ཀུན་ནས་འབར་བ་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་གཅལ་བཀྲམ་པ་ཤིན་ཏུ་མཛེས་པ་བྲི་བར་བྱའོ། །
en: All of them should be depicted as residing in the realm of the Pure Abode, their beautiful forms covered with flowers and bright all around with multicolored light like multifaceted gemstones. {2.149}

source: ཕྱི་རོལ་འཁོར་ཡུག་ཏུ་ཟུར་བཞིའི་རྣམ་པར་བྱས་ཏེ།
en: “The inner maṇḍala has an outer perimeter in the shape of a square.

source: རྟ་བབས་བཞི་དང་ལྡན་པ་ཕྱོགས་བཞི་ནས་རྣམ་པ་སྣ་ཚོགས་པའི་ཚོན་སྣ་ལྔ་གསལ་བས་རི་མོ་ཤིན་ཏུ་དྲང་བ་དང་ལྡན་པ་ནང་གི་དཀྱིལ་འཁོར་བྲི་བར་བྱའོ། །
en: It has four archways and shines in the four cardinal directions with a vivid light of five colors. It should be demarcated with nicely colored cord stretched in straight lines.

source: ཤར་གྱི་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྟེང་དུ་རི་མོའི་དབུས་སུ་མེ་ཏོག་ཀུན་ནས་སྐྱེས་པའི་རྒྱལ་པོའི་དབང་པོ་པདྨའི་གདན་ལ་བཞུགས་པ། དེ་བཞིན་གཤེགས་པའི་གཟུགས་ཅུང་ཟད་ཆུང་བར་བྱའོ། །
en: In the eastern quarter, above Lord Śākyamuni, is Saṃkusumita Rājendra. He should be drawn in the center within the cord-lined area, sitting on a lotus, with the body of a tathāgata but small in size,

source: འོད་ཀུན་ནས་འབར་བའི་ཕྲེང་བས་ཁྱབ་པ། མཆོག་སྦྱིན་གྱི་ཕྱག་རྒྱ་དང་ལྡན་པ། སྐྱིལ་མོ་ཀྲུང་གིས་བཞུགས་པ།
en: and surrounded by a halo of blazing light. His right hand displays the boon-granting gesture, and he sits in the cross-legged posture. {2.150}

source: དེའི་གཡས་སུ་གཙུག་ཏོར་འཁོར་ལོས་སྒྱུར་བའི་ཕྱག་རྒྱ་བྲི་བར་བྱའོ། །གཡོན་དུ་ནི་གཟི་བརྗིད་ཕུང་པོའི་ཕྱག་རྒྱ་བྲི་བར་བྱའོ། །
en: “To the right and left of Saṃkusumita Rājendra should be drawn, respectively, the mudrās of the uṣṇīṣa [kings] Cakravartin and Tejorāśi.

source: དེ་བཞིན་གཤེགས་པའི་སྤྱན་གྱི་སྟེང་དུ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕྱག་རྒྱ་བྲི་བར་བྱའོ། །
en: The mudrā of Prajñāpāramitā should be drawn above Tathāgata­locanā .

source: བཅོམ་ལྡན་འདས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྟེང་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་མའི་ཕྱག་རྒྱའི་གཡས་སུ་བཅོམ་ལྡན་འདས་འོད་དཔག་ཏུ་མེད་པ་དེ་བཞིན་གཤེགས་པའི་གཟུགས་ཅན་བྱ་སྟེ
en: Above the noble Avalokiteśvara and to the right of the mudrā of Prajñāpāramitā should be drawn Lord Amitābha with the body of a tathāgata.

source: ཕྱག་མཆོག་སྦྱིན་པ། པདྨའི་གདན་ལ་བཞུགས་པ་ཀུན་ནས་འོད་འབར་བའི་ཕྲེང་བས་ཁྱབ་པ།
en: With his right hand Amitābha displays the boon-granting gesture; he sits on a lotus seat and is surrounded by a halo of blazing light. {2.151}

source: དེའི་ཡང་གཡས་ཕྱོགས་སུ་ནི་ལྷུང་བཟེད་དང་ཆོས་གོས་ཀྱི་ཕྱག་རྒྱ་བྱའོ། །
en: “To Amitābha’s right the mudrās of the alms bowl and the monk’s robe should be drawn.

source: དེ་བཞིན་དུ་མཐར་གྱིས་འཇུག་པའི་གནས་ལ་ནི་པདྨའི་ཕྱག་རྒྱ་བྱའོ། །
en: Following the sequence, the lotus mudrā should be drawn at the entrance.

source: བཅོམ་ལྡན་འདས་མེ་ཏོག་ཡང་དག་པར་སྐྱེས་པའི་རྒྱལ་པོའི་དབང་པོ་དེ་བཞིན་གཤེགས་པའི་གཡོན་ཕྱོགས་སུ་གཙུག་ཏོར་གཟི་བརྗིད་ཕུང་པོའི་ཕྱག་རྒྱ་བྲི་སྟེ་ཀུན་ནས་འོད་འབར་བའི་ཕྲེང་བས་ཁྱབ་པ།
en: To the left of Lord Saṃkusumita Rājendra, the mudrā of the uṣṇīṣa king Tejorāśi should be drawn surrounded by a halo of blazing light.

source: དེའི་གཡོན་ཕྱོགས་སུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཏོག་བྱ་སྟེརིན་པོ་ཆེའི་རི་བོའི་སྟེང་དུ་ཆོས་སྟོན་ཅིང་བཞུགས་པ།
en: To his left the thus-gone Ratnaketu should be drawn sitting upon a jewel mountain and expounding the Dharma.

source: བཻ་ཌཱུརྱ་སྔོན་པོ་དང་མརྒད་དང་པདྨ་རཱ་ག་རྣམ་པ་སྣ་ཚོགས་འབར་བའི་འོད་འཕྲོ་བའི་ཀུན་ནས་འོད་དང་ལྡན་པ་བྲི་བར་བྱའོ། །
en: He should be depicted as surrounded by light emanating all around from a multicolored blaze of sapphires, beryls, emeralds, and rubies. {2.152}

source: དེའི་ཡང་གཡོན་ཕྱོགས་སུ་རྒྱལ་བའི་གཙུག་ཏོར་གྱི་ཕྱག་རྒྱ་ཀུན་ནས་འབར་བའི་ཕྲེང་བས་ཁྱབ་པ་བྲིའོ། །
en: “To the left of Ratnaketu should be painted the mudrā of Jayoṣṇīṣa, surrounded by a halo of blazing light.

source: དེའི་ཡང་གཡོན་ཕྱོགས་སུ་ཆོས་ཀྱི་འཁོར་ལོའི་ཕྱག་རྒྱ་ཀུན་ནས་འབར་བ་དང་ལྡན་པ་བྲིའོ། །
en: To its left is the mudrā of the Dharma wheel, with light blazing all around it.

source: དེའི་ཡང་གཡོན་ཕྱོགས་སུ་འཁར་གསིལ་དང་། སྤྱི་བླུགས་དང་ཕྲེང་བ་དང་བཟང་པོའི་གདན་གྱི་ཕྱག་རྒྱ་བྲིའོ། །
en: To its left are the mudrās of a mendicant’s staff, water jar, rosary, and the auspicious throne.

source: མཐར་གྱིས་སྒོའི་གནས་སུ་རྡོ་རྗེ་རྩེ་གསུམ་པ་གཉིས་ཀ་ལ་ཡང་ཀུན་ནས་འབར་བ་བྲིའོ། །
en: Next in sequence, at the gate of the maṇḍala, should be painted an earth vajra with three prongs at either end, radiating blazing light.

source: བཅོམ་ལྡན་འདས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་འོག་ཏུ་ཕྱག་རྒྱ་ཆེན་པོ་གཙུག་ཕུད་ལྔ་ཞེས་བྱ་བ་དང་། ཨུཏྤ་ལའི་ཕྱག་རྒྱ་ཀུན་ནས་འབར་བ་འདི་གཉིས་ཕན་ཚུན་འབྲེལ་བ་བྱའོ། །
en: The great five-crested mudrā and the utpala mudrā, both radiating blazing light and connected to one another, should be painted below Lord Mañjuśrī. {2.153}

source: དཀྱིལ་འཁོར་ཀུན་ནས་སྒོ་བྲི་བར་བྱའོ། །
en: “Then the surrounding maṇḍala should be drawn.

source: སྒོ་དག་ནི་རྒྱབ་ཀྱིས་ལྟ་བ་དང་། འཇུག་པ་ན་ནི་མདུན་གྱིས་བལྟ་བར་བྱའོ། །
en: It should be made so that one enters it via the western gate, and it should be facing to the east.

source: ཕྱི་རོལ་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་འགྱུར་བ་ཡང་ཁ་དོག་ལྔའི་ཚོན་ཤིན་ཏུ་གསལ་བ་སྣ་ཚོགས་བལྟ་ན་སྡུག་པ། ཟུར་བཞིས་རྣམ་པར་འབྱེས་པ། རྟ་བབས་བཞིའི་རྣམ་པ་ཕྱོགས་བཞིར་ཁྲུ་གཉིས་ཙམ་ནང་གི་དཀྱིལ་འཁོར་གྱི་ཕྱི་རོལ་གྱི་ཤར་ཕྱོགས་སུ་ཚངས་པ་ཆེན་པོ་བྲི་བར་བྱ་སྟེགདོང་བཞི་པ་གོས་དཀར་པོ་བགོས་པ་ལ་སྟོད་གཡོགས་གོས་དཀར་པོ་དང་། ཚངས་སྐུད་དཀར་པོ་ཐོགས་པ།
en: This outer maṇḍala should be painted in all its aspects the same as the inner one—it radiates five-colored light, is beautiful to behold in its vividness, and it has four gateways in the four cardinal directions. It should extend two cubits beyond the inner maṇḍala. {2.154} “In the eastern quarter should be painted the Great Brahmā with four faces, wearing white apparel including a white shirt and a white sacred thread.

source: ཁ་དོག་གསེར་འདྲ་བ། རལ་པའི་ཅོད་ཅན་འཛིན་པ། ལག་ན་དབྱུག་པ་དང་། སྤྱི་བླུགས་འཛིན་པ།
en: He is of golden color, wears a diadem on his topknotted hair, and carries a water jar and a walking stick in his left hand.

source: དེའི་གཡས་ཕྱོགས་སུ་འོད་གསལ་གྱི་ལྷའི་བུ་བྱ་སྟེ
en: To his right there is a god from the Ābhāsvara realm—golden in color, distinguished in appearance due to his meditation, wearing silken garments and a silken shirt, and with a serene expression on his face.

source: མདོག་གསེར་འདྲ་བ་བསམ་གཏན་ཁྱད་པར་ཅན་གྱི་གཟུགས་ཅན། དར་ལའི་གོས་བགོས་པ་དར་ལའི་སྟོད་གཡོགས་བྱས་པ། བཞིན་ཤིན་ཏུ་གསལ་བ་རལ་བའི་ཅོད་ཅན་འཛིན་པ་མཆོད་ཕྱིར་ཐོགས་དཀར་པོ་ཅན།
en: He wears a diadem on his topknotted hair and a white sacred thread. He sits in the cross-legged posture with his right hand displaying the boon-granting gesture. {2.155}

source: སྐྱིལ་མོ་ཀྲུང་གིས་འདུག་པ་ལག་གཡས་པས་མཆོག་སྦྱིན་པ། དེའི་གཡས་ཕྱོགས་སུ་འོག་མིན་གྱི་ལྷའི་བུ་བྱ་སྟེ
en: “To his right should be painted a god from the Akaniṣṭha realm,

source: རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། ལུས་རབ་ཏུ་ཞི་བ་བསམ་གཏན་གྱི་རྣམ་པའི་ཆ་བྱད་ཅན།
en: adorned with all types of jewelry. With his mind steeped in meditation, he is of peaceful appearance.

source: དར་ལའི་གོས་བགོས་པ་དར་ལའི་གོས་ཀྱིས་སྟོད་གཡོགས་བྱས་པ། སྐྱིལ་མོ་ཀྲུང་གིས་འདུག་པ་ལག་པ་གཡས་པས་མཆོག་སྦྱིན་པ།
en: He is wearing silk garments and a silk shirt, sits in the cross-legged posture, and displays with his right hand the boon-granting gesture.

source: མཆོད་ཕྱིར་ཐོགས་དཀར་པོས་བྱས་པ།
en: He is invested with a white sacred thread.

source: དེའི་རིམ་གྱིས་དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། འཐབ་བྲལ་དང་། བརྒྱ་བྱིན་ལ་སོགས་པའི་ལྷའི་བུ་བྲི་བར་བྱ་སྟེ
en: The gods from the Tuṣita, Sunirmita, and Paranirmita realms should be painted following the same sequence,

source: གོ་རིམས་ཇི་ལྟ་བ་དང་ཆ་བྱད་དང་དབྱིབས་ཅི་ལྟ་བ་བཞིན་དུའོ། །
en: and they are headed by Suyāma and Śakra, each at his assigned location, and following the right order.

source: བརྒྱ་བྱིན་གྱི་འོག་ཏུ་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་རིས་ལ་རྟག་ཏུ་མྱོས་དང་། ཕྲེང་ཐོགས་དང་། ལག་ན་གཞོང་ཐོགས་དང་། པི་བང་གཉིས་པ་དང་ས་བླའི་ལྷའི་བུ་དག་གོ་རིམས་ཇི་ལྟ་བ་དང་། ཆ་བྱད་ཇི་ལྟ་བ་བཞིན་དུ་བྲི་བར་བྱའོ། །
en: Below Śakra should be painted gods from the realm of the four great kings, as well as the sadāmatta s, mālādhārins, karoṭapāṇis, and vīṇādvītiyakas. The gods of the earth should likewise be painted sequentially arranged, with all their respective attributes. {2.156}

source: དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་སུ་མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་ཤིན་ཏུ་མཐོང་བ་དང་གྱ་ནོམ་སྣང་དང་། དགེ་ཆུང་དང་བསོད་ནམས་སྐྱེས་ལ་སོགས་པའི་ལྷའི་བུ་ཆ་བྱད་དང་དབྱིབས་ཅི་ལྟ་བ་བཞིན་བྲི་བར་བྱའོ། །
en: “Similarly, in the southern quarter, the gods starting with those from the Avṛha, Atapas, Sudṛśa, Sudarśana, Parīttābha , and Puṇyaprasava realms should be drawn, all in their respective places and wearing their individual ornaments.

source: ནུབ་ཕྱོགས་དང་བྱང་ཕྱོགས་སུ་ཡང་དེ་བཞིན་ཏེ།
en: The same should be done for the western and northern quarters.

source: དེ་དག་ནི་རིམ་པ་འོག་མ་གཉིས་ལ་བརྟེན་ཏེ་བྲི་བར་བྱའོ། །
en: More are drawn below the ones just mentioned, arranged in two rows. {2.157}

source: དཀྱིལ་འཁོར་གཉིས་ཀྱི་ཕྱི་རོལ་དུ་དཀྱིལ་འཁོར་གསུམ་པར་འགྱུར་བ་ལ། མཐར་གྱིས་ཕྱོགས་བཞིར་རྒྱལ་པོ་ཆེན་པོ་བཞི་སྟེ།
en: “Outside of the second circle there is the third circle in which the four great kings are drawn sequentially in the four quarters.

source: བྱང་ཕྱོགས་ནས་འཇུག་པའི་གཡས་ངོས་སུ་གཏེར་ཉེ་བར་གནས་པ་ལ། ནོར་སྦྱིན་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། གཙུག་ཕུད་ཅུང་ཟད་འདུད་པ་གནོད་སྦྱིན་གྱི་གཟུགས་ཅན།
en: To the right of the entrance gate in the northern direction should be painted Dhanada in the form of a yakṣa standing next to a treasure trove. He is adorned with all types of jewelry and wears a slightly curved diadem.

source: དེའི་གཡས་སུ་ནོར་བུ་བཟང་པོ་དང་གང་བ་བཟང་པོ་གནོད་སྦྱིན་གྱི་བདག་པོ་གཉིས་བྲིའོ། །
en: To his right are the two yakṣa generals, Maṇibhadra and Pūrṇabhadra. {2.158}

source: དེ་བཞིན་དུ་མཐར་གྱིས་ནུབ་ཕྱོགས་སུ་ཆུ་ལྷ་ལག་ན་ཞགས་པ་ཐོགས་པ་དང་། ཀླུ་དགའ་བོ་དང་། ཉེ་དགའ་བོ་དང་། འཇོག་པོ་དང་། ནོར་རྒྱས་ལ་སོགས་པ་ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་བརྒྱད་པོ་བྲིའོ། །
en: “Following next, in the west, should be drawn Varuṇa with a noose in his hand, followed by the two nāga s Nanda and Upananda and the eight great nāga kings, starting with Takṣaka and Vāsuki. {2.160}

source: དེ་བཞིན་དུ་རིམ་པ་གཉིས་ལ་གནས་པའི་མཐར་གྱིས་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། དྲང་སྲོང་དང་། གྲུབ་པ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། ནམ་མཁའ་ལྡིང་དང་མི་དང་མི་མ་ཡིན་པ་ལ་སོགས་པ་དང་། སྨན་དང་ནོར་བུ་རིན་པོ་ཆེའི་བྱེ་བྲག་དང་རི་དང་ཆུ་བོ་དང་གླིང་དང་མཐར་གྱིས་གཙོ་བོ་ཐམས་ཅད་བྲི་བར་བྱའོ། །
en: “In this way should be painted two sequentially arrayed rows of yakṣa s, rākṣasas, gandharvas, kinnaras, mahoragas, ṛṣis, siddha s, pretas, piśācas, garuḍas, and other human and nonhuman beings, as well as medicinal herbs, gems and jewels in all their variety, mountains, rivers, and islands—with the chief and most important among them at the head. {2.161}

source: ལྷོ་ཕྱོགས་སུ་ནི་གཤིན་རྗེ་མ་མོ་བདུན་གྱི་འཁོར་དང་བཅས་པ་བྲི་བར་བྱའོ། །
en: “In the southern quarter should be painted Yama along with his retinue, which includes the seven mothers.

source: ཤར་ལྷོ་མཚམས་སུ་མེ་ཀུན་ནས་འབར་བའི་ཕྲེང་བས་ཁྱབ་པ།
en: In the southeastern quarter is Agni, depicted as surrounded by a halo of flames;

source: དབྱུག་པ་དང་སྤྱི་བླུགས་དང་ཕྲེང་བ་ལག་ན་ཐོགས་པ། རལ་པའི་ཅོད་པན་འཛིན་པ། གོས་དཀར་པོ་བགོས་པ།
en: holding a staff, a water jar, and a rosary in his hands; wearing a diadem atop his matted hair; and dressed in white garments including a shirt of fine silk.

source: དར་ལའི་སྟོད་གཡོགས་བྱས་པ། མཆོད་ཕྱིར་ཐོགས་དཀར་པོ་ཐོགས་པ། མདོག་གསེར་འདྲ་བ་ཐལ་བའི་ཐིག་ལེ་གསུམ་བྱས་པ།
en: He is of golden color, wearing a white sacred thread, and has a triple line drawn with ash on his forehead.

source: དེ་བཞིན་དུ་རྒྱན་དང་མཚོན་ཆ་དང་ཆ་བྱད་དང་དབྱིབས་དང་ཁ་དོག་རྣམ་པ་སྣ་ཚོགས་པ་རིམ་པ་གཉིས་པ་ལ་བརྟེན་ཏེ་བྲི་བར་བྱའོ། །
en: They are all painted arranged in two rows, with their various respective adornments, weapons, attire, body postures, and colors. {2.162}

source: ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་དུ་འཇུག་པའི་སྒོའི་ཕྱི་རོལ་དུ་དཀའ་ཟློག་གི་བདག་པོ་ཁྱུ་མཆོག་ལ་ཞོན་པ། ལག་ན་མདུང་རྩེ་གསུམ་ཐོགས་པ་ལྷ་མོ་དཀའ་ཟློག་མ་ཁ་དོག་སྣ་ཚོགས་པ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: “All around the area outside this triple maṇḍala are distributed the following deities: Umā’s husband, riding a bull, with a trident in his hand; the goddess Umā herself, of golden color, adorned with all kinds of jewelry;

source: སྨིན་དྲུག་གི་བུ་རྨ་བྱའི་སྟན་ལ་འདུག་པ་མདུང་ཐོགས་པ། གཞོན་ནུའི་གཟུགས་ཅན་གདོང་དྲུག་པ་ལུས་དམར་པོར་སྣང་བ། གོས་སེར་པོ་བགོས་པ། གོས་སེར་པོའི་སྟོད་གཡོགས་ཅན་ལག་པ་གཡོན་པ་ན་དྲིལ་བུ་དང་བ་དན་དམར་པོ་ཐོགས་པ།
en: and Kārttikeya , in his form of a divine youth with six faces and a red body, sitting on a peacock, raising a javelin in his hand, wearing yellow garments and a yellow shirt, and holding in his left hand a bell and a red banner.

source: མཐར་གྱིས་བྷྲིང་གི་རི་ཏི་ཤིན་ཏུ་རིད་པ་འདྲ་བ་དང་། ཚོགས་ཀྱི་བདག་པོ་ཆེན་པོ་དང་། དགའ་བྱེད་དབང་ཕྱུག་དང་ནག་པོ་ཆེན་པོ་དང་། མ་མོ་བདུན་པོ་རྒྱན་དང་མཚོན་ཆ་དང་ཁ་དོག་དང་དབྱིབས་ཅི་ལྟ་བ་བཞིན་བྲི་བར་བྱའོ། །
en: Next in sequence are Bhṛṅgiriṭi, extremely emaciated, Mahāgaṇapati, Nandikeśvara, Mahākāla, and the seven mothers. They should be painted with their respective adornments, weapons, attire, and body postures. {2.163}

source: ནོར་ལྷ་བརྒྱད་དང་དྲང་སྲོང་བདུན་དང་ཁྱབ་འཇུག་ལག་པ་བཞི་ན་འཁོར་ལོ་དང་དུང་དང་ག་དཱ་དང་རལ་གྲི་ཐོགས་པ།
en: “Next to be painted are the eight vasus and seven ṛṣis. Viṣṇu should be painted with four arms, holding a discus, a mace, a conch, and a sword.

source: གདན་ནམ་མཁའ་ལྡིང་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: He rides a garuḍa and is adorned with all types of jewelry.

source: གཟའ་བརྒྱད་དང་རྒྱུ་སྐར་ཉི་ཤུ་རྩ་བདུན་དང་། གང་ཡང་ཉེ་བའི་གཟའ་བརྒྱད་ས་སྟེང་གི་དཀྱིལ་འཁོར་ན་རབ་ཏུ་རྒྱུ་བ་ཡང་བྲི་བར་བྱའོ། །
en: Next are the eight grahas, the twenty-seven constellations, and the eight upagraha deities who roam the expanse of the earth.

source: མཐར་གྱིས་ཚེས་གྲངས་བཅྭ་ལྔ་དང་ཡར་ངོ་དང་མར་ངོའི་ཕྱོགས་དང་། ཁྱིམ་བཅུ་གཉིས་དང་དུས་དྲུག་དང་ཟླ་བ་བཅུ་གཉིས་དང་ལོ་ཚིགས་དང་།
en: Following next are the personifications of the fifteen lunar days of the bright fortnight and the fifteen of the dark fortnight, the twelve signs of the zodiac, the six seasons, the twelve months, and of the year.

source: སྲིང་མོ་བཞི་གྲུ་ལ་ཞོན་པ་དང་མིང་པོ་ལྔ་གྲུ་ལ་ཞོན་ཞིང་ཆུ་ལ་གནས་པ་སྟེ།
en: Next are the four sisters, riding in boats, and the five brothers who live in water.

source: མདོར་ན་ཕྱག་རྒྱར་གཞག་པར་བྱ་བ་ཡང་ཡིན་ནོ། །ལྷ་མོ་དེ་དག་མཐར་གྱིས་རིམ་པ་གཉིས་པ་ལ་བརྟེན་ཏེ་བྱ་བ་ཡིན་ནོ། །
en: For conciseness these deities can be represented by their respective mudrās and arranged sequentially in two rows. {2.164}

source: མདོར་ན་དཀྱིལ་འཁོར་གསུམ་ཡང་དཀྱིལ་འཁོར་ལ་བརྟེན་ཅིང་བྲི་བར་བྱ་སྟེ། དཀྱིལ་འཁོར་གསུམ་ཆར་ཡང་གྲུ་བཞིར་རྣམ་པར་གནས་པར་བྱ་བ་ཡིན་ནོ། །
en: “In short, as regards the three maṇḍalas, one should draw them also as the three dwelling places ( āśraya ), each with the four corners, with the distribution [of the deities] as follows: {2.165}

source: མདོར་ན་འདི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སེམས་ཅན་རྣམས་ཀྱི་མགོན་པོ་ནི་ངེས་པར་བྲི་བར་བྱའོ། །
en: “In short, Lord Buddha must be painted at the head of all beings.

source: པདྨའི་རིགས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཀྱང་ངེས་པར་བྲི་བར་བྱའོ། །
en: Representing the Lotus family , Noble Avalokiteśvara must be painted to Śākyamuni’s right.

source: རྡོ་རྗེའི་རིགས་འཕགས་པ་ཕྱག་ན་རྡོ་རྗེའང་ངེས་པར་བྲི་བར་བྱའོ། །
en: Representing the Vajra family , Noble Vajrapāṇi must be painted to Śākyamuni’s left.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཙོ་བོ་འཕགས་པ་ཀུན་དུ་བཟང་པོའང་ངེས་པར་བྲི་བར་བྱའོ། །
en: Samantabhadra must be painted at the head of all bodhisattvas,

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའང་ངེས་པར་བྲི་བར་བྱའོ། །
en: and likewise the divine youth, Mañjuśrī, should also be included.

source: ལྷག་མ་རྣམས་ནི་ཇི་ལྟར་རྣམ་པར་བཞག་པ་བཞིན་ཕྱག་རྒྱ་བྲི་བར་བྱའོ། །
en: The remaining ones should each be represented by his or her mudrā in their respective places.

source: འདི་ནི་ནང་གི་དཀྱིལ་འཁོར་རོ། །
en: This is how the inner maṇḍala should be painted. {2.166}

source: དཀྱིལ་འཁོར་བར་མ་ལ་ཡང་ཤར་ཕྱོགས་སུ་ནི་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་བྲི་བར་བྱའོ། །
en: “In the middle maṇḍala, Brahmā Sahāmpati must be painted in the eastern quarter.

source: དེ་བཞིན་དུ་འོད་གསལ་བ་ནི་ལྷོ་ཕྱོགས་སུའོ། །འོག་མིན་གྱི་གཟུགས་ཅན་རྣམས་ལྷའི་དཀྱིལ་འཁོར་གྱི་རྣམ་པར་རོ། །འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་གྱི་སྐྱེ་མཆེད་ཀྱི་བར་ནི་བརྗོད་པར་མི་བྱའོ། །
en: Similarly, in the southern quarter are the Ābhāsvara and Akaniṣṭha gods, the form gods, and the gods from the realm of neither consciousness nor unconsciousness who do not appear in the maṇḍala in any particular form.

source: བྱང་ཕྱོགས་སུ་བརྒྱ་བྱིན་ལྷའི་རྒྱལ་པོ་དང་། རབ་འཐབ་བྲལ་དང་། ཡོངས་སུ་དགའ་ལྡན་དང་། རབ་འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། འོད་ཆུང་ལ་སོགས་པའི་ལྷའི་བུ་རྣམས་ངེས་པར་ལྷའི་རྒྱལ་པོ་རེ་རེ་བྱའོ། །
en: In the northern quarter are the king of gods Śakra and the gods starting with those from the realms of Suyāma, Tuṣita, Sunirmita, Paranirmita, and Parīttābha . Each king of the gods’ realms must be painted individually.

source: ལྷག་མ་རྣམས་ནི་ཕྱག་རྒྱར་གནས་པར་བྱའོ། །
en: The rest should be represented by their respective mudrās. {2.167}

source: དེ་བཞིན་དུ་དཀྱིལ་འཁོར་གསུམ་པར་ཡང་བྱང་ཕྱོགས་སུ་འབྱུང་པོའི་བདག་པོ་དབང་ལྡན་དཀའ་ཐུབ་ཟློག་མ་དང་བཅས་པ་ངེས་པར་བྲིའོ། །
en: “Similarly, in the third maṇḍala, Īśāna the Lord of Beings must be painted in the northern quarter together with Umā.

source: འཇམ་དཔལ་གྱི་སྒོ་གཉིས་པའི་སྒོའི་དྲུང་དུ་ནི་སྨིན་དྲུག་གི་བུ་རྨ་བྱའི་སྟན་ཡོད་པ་ལག་ན་མདུང་ཐོགས་པ།
en: Kārttikeya -Mañjuśrī should be painted near the second gate, riding on a peacock and holding a javelin in his hand.

source: ལུས་ཀྱི་ཁ་དོག་དམར་བ། གོས་སེར་པོས་སྟོད་གཡོགས་དང་གོས་བྱས་པ་ལག་པ་གཡས་པ་ན་དྲིལ་བུ་དང་བ་དན་ཐོགས་པ།
en: His body is of red color and he is dressed in a yellow upper shirt and other garments. In his right hand he holds a bell and a red banner.
